pulmanturbd/certification4/CabinListRQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cab="http://services.rccl.com/Interfaces/CabinList" xmlns:alp="http://www.opentravel.org/OTA/2003/05/alpha">
   <soapenv:Header/>
   <soapenv:Body>
      <cab:getCabinList>
        <OTA_CruiseCabinAvailRQ MaxResponses="50" MoreDataEchoToken="01" Target="Test" RetransmissionIndicator="false" SequenceNmbr="1" TimeStamp="2008-11-25T10:08:12.204-05:00" TransactionIdentifier="106597" Version="1.0" xmlns="http://www.opentravel.org/OTA/2003/05/alpha">
            <POS>
                <Source TerminalID="12502LDJW6" ISOCurrency="USD">
                    <RequestorID ID="313917" ID_Context="AGENCY1" Type="5"/>
                    <BookingChannel Type="7">
                        <CompanyName CompanyShortName="PULLMANTUR"/>
                    </BookingChannel>
                </Source>
                <Source TerminalID="12502LDJW6" ISOCurrency="USD">
                    <RequestorID ID="313917" ID_Context="AGENCY2" Type="5"/>
                    <BookingChannel Type="7">
                        <CompanyName CompanyShortName="PULLMANTUR"/>
                    </BookingChannel>
                </Source>
                <Source TerminalID="12502LDJW6" ISOCurrency="USD">
                    <RequestorID ID="313917" ID_Context="AGENT1" Type="5"/>
                    <BookingChannel Type="7">
                        <CompanyName CompanyShortName="PULLMANTUR"/>
                    </BookingChannel>
                </Source>
            </POS>
            <Guest Age="30">
                <GuestTransportation Mode="29" Status="36">
                    <GatewayCity CodeContext="IATA" LocationCode="BCN"/>
                </GuestTransportation>
            </Guest>
            <Guest Age="1">
                <GuestTransportation Mode="29" Status="36">
                    <GatewayCity CodeContext="IATA" LocationCode="BCN"/>
                </GuestTransportation>
            </Guest>
            <GuestCounts>
                <GuestCount Age="30" Quantity="1"/>
                <GuestCount Age="1" Quantity="1"/>
            </GuestCounts>
            <SailingInfo>
                <SelectedSailing ListOfSailingDescriptionCode="6" Start="2020-07-11" Duration="P7N" Status="36" PortsOfCallQuantity="5">
                    <CruiseLine VendorCode="PUL" ShipCode="MO"/>
                    <!--Optional:-->
                    <Region RegionCode="PISFE" SubRegionCode="PGH"/>
                    <!--Optional:-->
                    <DeparturePort LocationCode="REK"/>
                    <!--Optional:-->
                    <ArrivalPort LocationCode="TRD"/>
                </SelectedSailing>
                <InclusivePackageOption CruisePackageCode="MOPN0712"/>
                <Currency CurrencyCode="USD" DecimalPlaces="2"/>
                <SelectedCategory BerthedCategoryCode="A" PricedCategoryCode="A" WaitlistIndicator="false">
                </SelectedCategory>
            </SailingInfo>
            <SearchQualifiers BerthedCategoryCode="A" FareCode="C4443339" GroupCode="2" CategoryLocation="Deluxe">
                <Status Status="36"/>
            </SearchQualifiers>
            <SelectedFare GroupCode="2"/>
        </OTA_CruiseCabinAvailRQ>
    </cab:getCabinList>
   </soapenv:Body>
</soapenv:Envelope>